@echo off

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

:: 设置控制台标题
title 死神vs火影 绊 - 控制

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::



::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

:: 检测操作系统语言
chcp | find "936" >nul || (
	echo The operating system language must be Chinese! && goto :ERROR
)

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::



::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

set MM_CFG=mm.cfg

:: 寻找当前目录的父目录
for %%a in ("..") do (
	set parent=%%~fa
)

:: 调用 python 命令启动程序
set toolPath=%CD%\_Tool
set PATH=%PATH%;%toolPath%\Python34
set dbgmain=%toolPath%\dbgmain.py
set adlExe=%toolPath%\adl.exe
set gameData=%parent%\swf_output

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::



::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

:: 复制 mm.cfg 文件到指定位置
copy %toolPath%\%MM_CFG% %USERPROFILE%\%MM_CFG% >nul

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::



::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

python -OO %dbgmain% %adlExe% %gameData%

:: 如果退出代码不为 0，输出错误代码
set error=%ERRORLEVEL%
if not %error% == 0 (
	echo 出错！错误代码为：%error%
	goto :ERROR
)

goto :END

:: 如果有错误信息，提示后再退出
:ERROR
pause >nul
:END
exit

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::